Revit 2027 API
PrimarySizeCriterion.MaximumSize Property
 The maximum size of this criterion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaximumSize { get; set; }
Public Property MaximumSize As Double
	Get
	Set
public:
property double MaximumSize {
	double get ();
	void set (double value);
}
member MaximumSize : float with get, set
Property Value
Double
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace